import re
import logging
import nltk

MIDDLE_DASH_BETWEEN_DIGITS_REGEXP = re.compile(r'(\d+)\s*[-—–]\s*(\d+)', re.MULTILINE)


def middle_dash_between_digits(text):
    def replacer(matchobj):
        return '%s–%s' % (matchobj.group(1), matchobj.group(2))

    return re.sub(MIDDLE_DASH_BETWEEN_DIGITS_REGEXP, replacer, text)


CANONIC_DICT = {
    'Быт.': 'Быт.',
    'Исх.': 'Исх.',
    'Лев.': 'Лев.',
    'Чис.': 'Чис.',
    'Числ.': 'Чис.',
    'Втор.': 'Втор.',
    'Нав.': 'Нав.',
    'Суд.': 'Суд.',
    'Руф.': 'Руф.',
    '1 Цар.': '1Цар.',
    '2 Цар.': '2Цар.',
    '3 Цар.': '3Цар.',
    '4 Цар.': '4Цар.',
    '1 Пар.': '1Пар.',
    '2 Пар.': '2Пар.',
    '1 Паралип.': '1Пар.',
    '2 Паралип.': '2Пар.',
    '1 Ездр.': '1Ездр.',
    'Неем.': 'Неем.',
    '2 Ездр.': '2Ездр.',
    'Тов.': 'Тов.',
    'Иудиф.': 'Иудиф.',
    'Эсф.': 'Эсф.',
    '1 Мак.': '1 Мак.',
    '2 Мак.': '2Мак.',
    '3 Мак.': '3Мак.',
    '3 Ездр.': '3Ездр.',
    'Иов.': 'Иов.',
    'Пс.': 'Пс.',
    'Притч.': 'Притч.',
    'Еккл.': 'Еккл.',
    'Песн.': 'Песн.',
    'Прем.': 'Прем.',
    'Сир.': 'Сир.',
    'Ис.': 'Ис.',
    'Иерем.': 'Иер.',
    'Вар.': 'Вар.',
    'Иезек.': 'Иез.',
    'Дан.': 'Дан.',
    'Ос.': 'Ос.',
    'Иоил.': 'Иоил.',
    'Ам.': 'Ам.',
    'Авд.': 'Авд.',
    'Ион.': 'Ион.',
    'Мих.': 'Мих.',
    'Наум.': 'Наум.',
    'Авв.': 'Авв.',
    'Соф.': 'Соф.',
    'Агг.': 'Агг.',
    'Зах.': 'Зах.',
    'Мал.': 'Мал.',
    'Мф.': 'Мф.',
    'Матф.': 'Мф.',
    'Мк.': 'Мк.',
    'Мрк.': 'Мк.',
    'Марк.': 'Мк.',
    'Лк.': 'Лк.',
    'Лук.': 'Лк.',
    'Ин.': 'Ин.',
    'Иоан.': 'Ин.',
    'Иоанн.': 'Ин.',
    'Деян.': 'Деян.',
    'Иак.': 'Иак.',
    '1 Петр.': '1Петр.',
    '2 Петр.': '2Петр.',
    '1 Иоан.': '1Иоан.',
    '2 Иоан.': '2Иоан.',
    '3 Иоан.': '3Иоан.',
    'Иуд.': 'Иуд.',
    'Рим.': 'Рим.',
    '1 Кор.': '1Кор.',
    '2 Кор.': '2Кор.',
    'Гал.': 'Гал.',
    'Галл.': 'Галл.',
    'Еф.': 'Еф.',
    'Ефес.': 'Еф.',
    'Флп.': 'Флп.',
    'Кол.': 'Кол.',
    'Колос.': 'Кол.',
    '1 Сол.': '1Сол.',
    '2 Сол.': '2Сол.',
    '1 Фес.': '1Фес.',
    '1 Фесс.': '1Фес.',
    '2 Фес.': '2Фес.',
    '2 Фесс.': '2Фес.',
    'Тим.': 'Тим.',
    '1 Тимоф.': '1Тимоф.',
    '1 Тим.': '1Тим.',
    '2 Тимоф.': '2Тимоф.',
    '2 Тим.': '2 Тим.',
    'Тит.': 'Тит.',
    'Филим.': 'Флм.',
    'Евр.': 'Евр.',
    'Апок.': 'Апок.',
    'Откр.': 'Откр.',
    'Сирах.': 'Сирах.'}


def canonic_links(text):
    keywords = set((key[:-1] for key in CANONIC_DICT.keys()))
    keywords.update((key[:-1] for key in CANONIC_DICT.values()))

    words = nltk.word_tokenize(text)
    for i, word in enumerate(words):
        if word in keywords:
            if i > 10:
                print(words[i-10:i+10])
            else:
                print(words[:i+10])

    return text
